# Exercise 1

In [1]:
import numpy as np
import pandas as pd
from env import get_db_url

#get_db_url

In [2]:
url = get_db_url('employees') #this is important.... do not print

In [3]:
#4
sql = """
SELECT * FROM employees
"""
emp = pd.read_sql(sql, url)
emp.shape

(300024, 6)

In [5]:
sql = """
SELECT * FROM titles
"""

titles = pd.read_sql(sql, url)
titles.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

In [11]:
# How many rows and columns do you have in each DataFrame?
#Is that what you expected?
titles.describe(include="all")

               emp_no     title   from_date     to_date
count   443308.000000    443308      443308      443308
unique            NaN         7        6393        5888
top               NaN  Engineer  1998-10-25  9999-01-01
freq              NaN    115003         132      240124
mean    253075.034430       NaN         NaN         NaN
std     161853.292613       NaN         NaN         NaN
min      10001.000000       NaN         NaN         NaN
25%      84855.750000       NaN         NaN         NaN
50%     249847.500000       NaN         NaN         NaN
75%     424891.250000       NaN         NaN         NaN
max     499999.000000       NaN         NaN         NaN

In [10]:
#9 How many unique titles are in the titles DataFrame?

pd.read_sql("SELECT COUNT(DISTINCT title) AS unique_title_count from titles", url)

   unique_title_count
0                   7

In [7]:
#10 What is the oldest date in the to_date column?
len(titles.title.unique())

7

In [8]:
titles.to_date.min()

datetime.date(1985, 3, 1)

In [9]:
#11 What is the most recent date in the to_date column?
pd.read_sql("SELECT MAX(to_date) FROM titles", url)

  MAX(to_date)
0   9999-01-01

# Excercise 2

 df.loc[:, 'math':'reading']

df.loc[: is the first number column... needed, 'math','reading']

link : https://ds.codeup.com/python/advanced-dataframes/#exercises-i

In [12]:
# loc alters the original

In [13]:
#df.iloc[start:end]   : cuts things with iloc

In [14]:
# .agg is the same as grouping in sql

In [ ]:
#